/*
 * 컴퓨터는 우리가 사용하는 언어를 이해하지 못하기때문에 우리의 언어를 기계어로 바꾸어서 기계에게 말해주어야한다.
 * 
 * 자바 가상 기계란 가상 기계의 명령어를 실제 기계의 명령어로 변화하는 것이다.
 * 
 * 
 * 자바파일  -> 클래스 파일 -> 실행화면
 *     (컴파일러)    (자바가상기계)
 * 
 * 클래스란 자바프로그램들의 구성요소로 자바는 클래스들의 모임으로 구성된다.
 * 
 * 클래스는 필드와 메소드로 나뉜다.
 *       (변수)
 *       
 * 메소드 - 프로그램이 해야 하는 작업을 적어놓는 곳 
 *        안에 들어 있는 문장들을 차례대로 실행한 후에 작업의 결과를 외부로 반환할 수 있다.
 *        (입력을 받아서 작업을 수행하고 결과를 내보내는 작은 기계)
 * 
 * main() 메소드는 String args[]라고 하는 매개변수를 가진다.
 * 
 * 변수 - 데이터를 담아두는 상자라고 할수 있다.(상자들은 식별을 위하여 이름표를 붙이기도 한다.)
 * 
 * 자료형은 변수에 저장되는 자료의 타입형태를 의미한다.
 * 
 * 크게 나눠 기초형과 참조형 두가지로 나뉜다.
 * 
 * 기초형 - 정수형,실수형,논리형,문자형
 * 
 * 참조형 - 클래스,인터페이스,배열
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */
